zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA166/drivers/fsl_clock.h
    kNONE_to_NONE = (0xFFFFFFFFU),                                     /*!< Attach NONE to NONE. */

} clock_attach_id_t;

/*! @brief Clock dividers */
typedef enum _clock_div_name
{
    kCLOCK_DivI3C0_FCLK = (0x0A4U), /*!< I3C0_FCLK clock divider */
    kCLOCK_DivCTIMER0   = (0x0ACU), /*!< CTIMER0   clock divider */
    kCLOCK_DivCTIMER1   = (0x0B4U), /*!< CTIMER1   clock divider */
    kCLOCK_DivCTIMER2   = (0x0BCU), /*!< CTIMER2   clock divider */
    kCLOCK_DivCTIMER3   = (0x0C4U), /*!< CTIMER3   clock divider */
    kCLOCK_DivCTIMER4   = (0x0CCU), /*!< CTIMER4   clock divider */
    kCLOCK_DivWWDT0     = (0x0D4U), /*!< WWDT0     clock divider */
    kCLOCK_DivFLEXIO0   = (0x0DCU), /*!< FLEXIO0   clock divider */
    kCLOCK_DivLPI2C0    = (0x0E4U), /*!< LPI2C0    clock divider */
    kCLOCK_DivLPI2C1    = (0x0ECU), /*!< LPI2C1    clock divider */
    kCLOCK_DivLPSPI0    = (0x0F4U), /*!< LPSPI0    clock divider */
    kCLOCK_DivLPSPI1    = (0x0FCU), /*!< LPSPI1    clock divider */
    kCLOCK_DivLPUART0   = (0x104U), /*!< LPUART0   clock divider */
    kCLOCK_DivLPUART1   = (0x10CU), /*!< LPUART1   clock divider */
    kCLOCK_DivLPUART2   = (0x114U), /*!< LPUART2   clock divider */
    kCLOCK_DivLPUART3   = (0x11CU), /*!< LPUART3   clock divider */
    kCLOCK_DivLPUART4   = (0x124U), /*!< LPUART4   clock divider */
    kCLOCK_DivUSB0      = (0x12CU), /*!< USB0      clock divider */
    kCLOCK_DivLPTMR0    = (0x134U), /*!< LPTMR0    clock divider */
    kCLOCK_DivADC       = (0x144U), /*!< ADC       clock divider */
    kCLOCK_DivCMP0_FUNC = (0x14CU), /*!< CMP0_FUNC clock divider */
    kCLOCK_DivCMP0_RR   = (0x154U), /*!< CMP0_RR   clock divider */
    kCLOCK_DivCMP1_FUNC = (0x15CU), /*!< CMP1_FUNC clock divider */
    kCLOCK_DivCMP1_RR   = (0x164U), /*!< CMP1_RR   clock divider */
    kCLOCK_DivCMP2_FUNC = (0x16CU), /*!< CMP2_FUNC clock divider */
    kCLOCK_DivCMP2_RR   = (0x174U), /*!< CMP2_RR   clock divider */
    kCLOCK_DivDAC0      = (0x17CU), /*!< DAC0      clock divider */
    kCLOCK_DivFLEXCAN0  = (0x184U), /*!< FLEXCAN0  clock divider */
    kCLOCK_DivFLEXCAN1  = (0x18CU), /*!< FLEXCAN1  clock divider */
    kCLOCK_DivLPI2C2    = (0x194U), /*!< LPI2C2    clock divider */
    kCLOCK_DivLPI2C3    = (0x19CU), /*!< LPI2C3    clock divider */
    kCLOCK_DivLPUART5   = (0x1A4U), /*!< LPUART5   clock divider */
    kCLOCK_DivTRACE     = (0x1ACU), /*!< DBG_TRACE clock divider */
    kCLOCK_DivCLKOUT    = (0x1B4U), /*!< CLKOUT    clock divider */
    kCLOCK_DivSYSTICK   = (0x1BCU), /*!< SYSTICK   clock divider */
    kCLOCK_DivSLOWCLK   = (0x378U), /*!< SLOWCLK   clock divider */
    kCLOCK_DivBUSCLK    = (0x37CU), /*!< BUSCLK    clock divider */
    kCLOCK_DivAHBCLK    = (0x380U), /*!< AHBCLK    clock divider */
    kCLOCK_DivFRO_HF    = (0x388U), /*!< FROHF     clock divider */
    kCLOCK_DivFRO_LF    = (0x38CU), /*!< FROLF     clock divider */
    kCLOCK_DivPLL1CLK   = (0x3E4U), /*!< PLL1CLK   clock divider */
    kCLOCK_DivMax       = (0x3E4U), /*!< MAX       clock divider */
} clock_div_name_t;

/*!
 * @brief firc trim source.
 */
typedef enum _clke_16k
{
    kCLKE_16K_SYSTEM   = VBAT_FROCLKE_CLKE(1U), /*!< To VSYS domain.     */
    kCLKE_16K_COREMAIN = VBAT_FROCLKE_CLKE(2U)  /*!< To VDD_CORE domain. */
} clke_16k_t;

/*!
 * @brief SCG status return codes.
 */
enum _scg_status
{
    kStatus_SCG_Busy       = MAKE_STATUS(kStatusGroup_SCG, 1), /*!< Clock is busy.  */
    kStatus_SCG_InvalidSrc = MAKE_STATUS(kStatusGroup_SCG, 2)  /*!< Invalid source. */
};

/*!
 * @brief sirc trim mode.
 */
typedef enum _sirc_trim_mode
{
    kSCG_SircTrimNonUpdate = SCG_SIRCCSR_SIRCTREN_MASK,
    /*!< Trim enable but not enable trim value update. In this mode, the
     trim value is fixed to the initialized value which is defined by
     trimCoar and trimFine in configure structure \ref sirc_trim_mode_t.*/

    kSCG_SircTrimUpdate = SCG_SIRCCSR_SIRCTREN_MASK | SCG_SIRCCSR_SIRCTRUP_MASK
    /*!< Trim enable and trim value update enable. In this mode, the trim
     value is auto update. */

} sirc_trim_mode_t;

/*!
 * @brief sirc trim source.
 */
typedef enum _sirc_trim_src
{
    kNoTrimSrc             = 0, /*!< No external tirm source.    */
    kSCG_SircTrimSrcSysOsc = 2U /*!< System OSC.                 */
} sirc_trim_src_t;

/*!
 * @brief sirc trim configuration.
 */
typedef struct _sirc_trim_config
{
    sirc_trim_mode_t trimMode; /*!< Trim mode.       */
    sirc_trim_src_t trimSrc;   /*!< Trim source.     */
    uint16_t trimDiv;          /*!< Divider of SOSC. */
    uint8_t cltrim;            /*!< Trim coarse value; Irrelevant if trimMode is kSCG_TrimUpdate. */
    uint8_t ccotrim;           /*!< Trim fine value; Irrelevant if trimMode is kSCG_TrimUpdate. */
} sirc_trim_config_t;

/*!
 * @brief SCG system OSC monitor mode.
 */
typedef enum _scg_sosc_monitor_mode
{
    kSCG_SysOscMonitorDisable = 0U,                         /*!< Monitor disabled. */
    kSCG_SysOscMonitorInt     = SCG_SOSCCSR_SOSCCM_MASK,    /*!< Interrupt when the SOSC error is detected. */
    kSCG_SysOscMonitorReset =
        SCG_SOSCCSR_SOSCCM_MASK | SCG_SOSCCSR_SOSCCMRE_MASK /*!< Reset when the SOSC error is detected.     */
} scg_sosc_monitor_mode_t;

/*!
 * @brief SCG PLL1 monitor mode.
 */
typedef enum _scg_pll1_monitor_mode
{
    kSCG_Pll1MonitorDisable = 0U,                           /*!< Monitor disabled. */
    kSCG_Pll1MonitorInt     = SCG_SPLLCSR_SPLLCM_MASK,      /*!< Interrupt when the PLL1 Clock error is detected. */
    kSCG_Pll1MonitorReset =
        SCG_SPLLCSR_SPLLCM_MASK | SCG_SPLLCSR_SPLLCMRE_MASK /*!< Reset when the PLL1 Clock error is detected. */
} scg_pll1_monitor_mode_t;

/*!
 * @brief The active run mode (voltage level).
 */
typedef enum _run_mode
{
    kMD_Mode, /*!< Mid voltage (1.0 V).       */
    kOD_Mode, /*!< Overdrive voltage (1.2 V). */
} run_mode_t;

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/**
 * @brief Enable the clock for specific IP.
 * @param clk : Clock to be enabled.
 * @return  Nothing
 */
static inline void CLOCK_EnableClock(clock_ip_name_t clk)
{
    uint32_t reg_offset         = CLK_GATE_REG_OFFSET(clk);
    uint32_t bit_shift          = CLK_GATE_BIT_SHIFT(clk);
    volatile uint32_t *pClkCtrl = (volatile uint32_t *)((uint32_t)(&(MRCC0->MRCC_GLB_CC0_SET)) + reg_offset);

